@ibacalu Following up on your example, it seems to work fine on a cluster provisoned with kube-prometheus-stack.
Could it be that you hit that error with another resource type?

I used your example and added the variables. Here's the result:
```
~/test-alpha-166 » terraform plan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_manifest.svcmon will be created
  + resource "kubernetes_manifest" "svcmon" {
      + manifest = {
          + apiVersion = "monitoring.coreos.com/v1"
          + kind       = "ServiceMonitor"
          + metadata   = {
              + labels    = {
                  + release = "terraform"
                }
              + name      = "terraform"
              + namespace = "default"
            }
          + spec       = {
              + endpoints         = [
                  + {
                      + interval = "15s"
                      + port     = "https"
                    },
                ]
              + namespaceSelector = {
                  + matchNames = [
                      + "default",
                    ]
                }
              + selector          = {
                  + matchLabels = {
                      + release = "terraform"
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "monitoring.coreos.com/v1"
          + kind       = "ServiceMonitor"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = {
                  + "release" = "terraform"
                }
              + managedFields              = (known after apply)
              + name                       = "terraform"
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + endpoints         = [
                  + {
                      + basicAuth         = {
                          + password = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                          + username = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                        }
                      + bearerTokenFile   = (known after apply)
                      + bearerTokenSecret = {
                          + key      = (known after apply)
                          + name     = (known after apply)
                          + optional = (known after apply)
                        }
                      + honorLabels       = (known after apply)
                      + honorTimestamps   = (known after apply)
                      + interval          = "15s"
                      + metricRelabelings = (known after apply)
                      + params            = (known after apply)
                      + path              = (known after apply)
                      + port              = "https"
                      + proxyUrl          = (known after apply)
                      + relabelings       = (known after apply)
                      + scheme            = (known after apply)
                      + scrapeTimeout     = (known after apply)
                      + targetPort        = (known after apply)
                      + tlsConfig         = {
                          + ca                 = {
                              + configMap = {
                                  + key      = (known after apply)
                                  + name     = (known after apply)
                                  + optional = (known after apply)
                                }
                              + secret    = {
                                  + key      = (known after apply)
                                  + name     = (known after apply)
                                  + optional = (known after apply)
                                }
                            }
                          + caFile             = (known after apply)
                          + cert               = {
                              + configMap = {
                                  + key      = (known after apply)
                                  + name     = (known after apply)
                                  + optional = (known after apply)
                                }
                              + secret    = {
                                  + key      = (known after apply)
                                  + name     = (known after apply)
                                  + optional = (known after apply)
                                }
                            }
                          + certFile           = (known after apply)
                          + insecureSkipVerify = (known after apply)
                          + keyFile            = (known after apply)
                          + keySecret          = {
                              + key      = (known after apply)
                              + name     = (known after apply)
                              + optional = (known after apply)
                            }
                          + serverName         = (known after apply)
                        }
                    },
                ]
              + jobLabel          = (known after apply)
              + namespaceSelector = {
                  + any        = (known after apply)
                  + matchNames = [
                      + "default",
                    ]
                }
              + podTargetLabels   = (known after apply)
              + sampleLimit       = (known after apply)
              + selector          = {
                  + matchExpressions = (known after apply)
                  + matchLabels      = {
                      + "release" = "terraform"
                    }
                }
              + targetLabels      = (known after apply)
              + targetLimit       = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

-------------------------------------------------------------------------------
~/test-alpha-166 » terraform apply -auto-approve

kubernetes_manifest.svcmon: Creating...
kubernetes_manifest.svcmon: Creation complete after 0s

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
---------------------------------------------------------------
```